[
    {
        "id": 1,
        "title": "Lightyear Teaser Trailer Shows Buzz's Origins, Releasing in 2022",
        "body": "Pixar has released the first official teaser for Lightyear, which will see Chris Evans voice the character in his \"definitive\" origin story. The film, first announced at last year's Disney+ Investor's Day, will follow the original Buzz Lightyear before he became the inspiration for the eponymous action figure in the Toy Story franchise. “Lightyear” is a sci-fi action-adventure and the definitive origin story of Buzz Lightyear (voice of Chris Evans) - the hero who inspired the toy,\" reads the sysnopsis for the film. \"The film reveals how a young test pilot became the Space Ranger that we all know him to be today. “Lightyear” is directed by Angus MacLane, produced by Galyn Susman, and opens in theaters in Summer 2022.\" Disney also released a new poster for the film which, similar to the teaser, doesn't reveal much about the film. With this year's Disney Plus Day coming up on November 12, it's possible that we'll learn (and see) more of the film, including the main trailer.", 
        "imageUrl": "https://sm.ign.com/t/ign_in/screenshot/default/buzz-lightyear-in-lightyear-2_wfeb.1280.jpg",
        "author": "Rahul Majumdar"
    },
    {
        "id": 2,
        "title": "A Quiet Place Video Game in Development, Releasing in 2022",
        "body" : "Horror film franchise A Quiet Place is getting a video game adaptation, due out in 2022. The game is being developed by Saber Interactive in partnership with Illogika and Ep1t0me. The official announcement states the game will be a \"new untold story-driven horror adventure\" set in the universe of A Quiet Place. There is no information on which platforms the game is being developed for, although given the mainstream recognisability of the franchise, a multi-platform release across PC and consoles makes sense.\"This first official video game set in the terrifying A Quiet Place universe will deliver an original story and gameplay that captures the compelling suspense, emotion and drama for which the series is famous,\" reads a statement from Saber Interactive. \"The game is in development by iLLOGIKA, the Montreal-based studio with veteran talent from the Rainbow Six and Far Cry franchises, and published by Saber Interactive, the Embracer Group company behind the hit game World War Z and the upcoming Evil Dead: The Game.\" The official website of the game doesn't give us any new info about it, so it looks like we'll have to wait for it to be revealed in due time. A Quiet Place as a franchise has become quite lucrative in the film space, so it remains to be seen whether it translates well into video games. A Quiet Place: Part 2 is now in cinemas in India.",
        "imageUrl": "https://sm.ign.com/t/ign_in/screenshot/default/a-quiet-place-video-game_vkk6.1280.png",
        "author": "Rahul Majumdar"
    },
    {
        "id": 3,
        "title": "Sackboy: A Big Adventure May Be Coming to PC",
        "body": "A SteamDB listing for what is thought to be Sackboy: A Big Adventure has been spotted, which may have given away a surprise announcement from Sony and Sumo Digital. The SteamDB listing points to the game being identified as \"Marmalade Content\" along with the branch name being \"sumoqa\" which was the same name correlating to Sackboy: A Big Adventure in the recent Nvidia Geforce Now leak. The leak has since proved to be quite accurate, with Sony revealing God of War's arrival on PC shortly after, which was one of the games listed in the database leak. However, it needs to be stated that not all games in the Geforce Now leak will actually make their way to PC. A SteamDB listing for what is thought to be Sackboy: A Big Adventure has been spotted, which may have given away a surprise announcement from Sony and Sumo Digital.The SteamDB listing points to the game being identified as \"Marmalade Content\" along with the branch name being \"sumoqa\" which was the same name correlating to Sackboy: A Big Adventure in the recent Nvidia Geforce Now leak. The leak has since proved to be quite accurate, with Sony revealing God of War's arrival on PC shortly after, which was one of the games listed in the database leak. However, it needs to be stated that not all games in the Geforce Now leak will actually make their way to PC.",
        "imageUrl": "https://sm.ign.com/t/ign_in/image/t/the-best-p/the-best-ps5-games_avjn.1280.jpg",
        "author": "Yash Patil"
    },
    {
        "id": 4,
        "title": "Returnal Update 2.0 Finally Adds ‘Suspend Cycle’ Option and Photo Mode",
        "body": "Housemarque has finally added a much-requested feature to suspend and save cycles in Returnal, along with a new photo mode. The new feature comes almost six months after the game released on PS5 in April, with Housemarque starting work on adding the feature shortly after the game's launch. As explained in an accompanying PlayStation blog post, the new \"Suspend Cycle\" feature will let players pause their cycle, \"letting you exit the game and turn off your console without losing your progress in that session.\" However there are limitations to this, as players can't use the suspend feature during \"boss battles, cinematics, first-person sequences or during intense combat scenarios.\" The suspend point will be deleted once the player logs back into the game. Before this, players would have to use the PlayStation 5's rest mode to take a break from their adventures in Atropos, and even then it wouldn't work properly all the time. The new photo mode can also be used at any point of the game except for select first-person sequences, where players can use it to change the \"focal distance, aperture, saturation or contrast\" along with the ability to select different light sources and frames.Returnal is out now on PlayStation 5 for Rs. 4,999. IGN India's review of the game was highly positive, calling the game \"an absolute joy to play\" and a worthy PS5 exclusive, which makes Housemarque's addition to PlayStation Studios more interesting.",
        "imageUrl": "https://sm.ign.com/t/ign_in/news/r/returnal-r/returnal-releasing-patch-tomorrow-that-wont-corrupt-your-sav_t752.1280.jpg",
        "author": "Shahrukh Khan"
    },
    {
        "id": 5,
        "title": "Steam Autumn and Winter Sale Dates for 2021 Revealed by Valve",
        "body": "The dates for the next major Steam sales (Autumn and Winter) have been revealed thanks to an official document by Valve on Steamworks. Here are the dates for the next Steam Sales this year as uncovered by PCGamer: Steam Halloween Sale - October 28 to Nov 1, 2021 Steam Autumn Sale - November 24th to 30th, 2021 Steam Winter Sale - December 22nd, 2021 to January 5th, 2022. Of course, this doesn't include the various publisher sales that happen often on the platform, but it's nice to have a firm grasp of when these sales are expected to go live. The last quarter of 2021 has some big games piled up, especially from Microsoft with Forza Horizon 5 and Halo Infinite, along with third-party games like Battlefield 2042. Steam is currently hosting its 'Midweek Madness' sale on the following games till October 28. The new Steam sales are also great for picking up games before the launch of the Steam Deck, which will support a majority of games on the platform, even though it may not launch in India as soon as it does in international markets.",
        "imageUrl": "https://sm.ign.com/t/ign_in/image/d/daily-deal/daily-deals-up-to-90-off-steam-summer-sale-and-early-amazon_krxp.1280.jpg",
        "author": "Someone Unknown"
    },
    {
        "id": 6,
        "title": "New State of Play Announcements May Have Been Leaked Thanks to PlayStation Store Updates",
        "body": "A host of updates to various game pages on the PlayStation Store may be the early signs of new announcements at this week's State of Play. Some of these make sense as there haven't been many updates on these games for a long time, especially Final Fantasy 16 and Gollum. PlayStation revealed that this week's State of Play will feature third party announcements, and Final Fantasy is as big as those come. As for the other games, we recently got to see a new trailer for Gotham Knights at DCFandome, but no new gameplay was shown, along with no mention of any release date. We've seen some gameplay of Tchia recently, but it has generated enough interest to warrant a segment on PlayStation's own show. As for Gollum, the new game by Daedalic Entertainment is set to release in 2022, and we recently got to see more of the game with IGN's hands-off preview of the same. Of course, this needs to be taken with a grain of salt as neither PlayStation, nor any of the third-party partners, have announced anything officially. This week's State of Play, roughly 20 minutes in length, will be broadcasted on PlayStation's official channels on October 28 at 2:30 AM (IST).",
        "imageUrl": "https://sm.ign.com/t/ign_in/news/f/final-fant/final-fantasy-16-story-is-set-in-stone-and-english-vo-is-alm_bfc7.1280.jpg",
        "author": "Anonymous"
    },
    {
        "id": 7,
        "title": "Ms. Marvel’s Live Action Powers To Be Inspired by Captain Marvel, Reveals New Promo Art",
        "body": "New promo art for Disney Plus' Ms. Marvel series reveals Kamala Khan's live-action powers may be more in line with Captain Marvel. The new promo art, as seen on Pyramid International, show Kamala in her superhero outfit with an \"embiggened\" fist, only in the form of an energy projection and not in a literal fashion, similar to Reed Richards' (Mr. Fantastic) powers. The new poster and badge pack mention the words \"Hero with Heart\" and \"Crystal Smash\", the latter of which could be what Kamala calls one of her moves. It makes sense to haver her powers based in energy projection and manipulation, bringing her closer to her idol Carol Danvers. Given that the Marvel Cinematic Universe hasn't yet introduced the Inhumans, it's clear thar Khan's origin story in the series will be heavily altered, drawing from existing concepts within the MCU. In the comics, Kamala Khan's gains her powers through the Terrigen mist, activating the 'Inhuman' genes within her in the aftermath of the \"Inhumanity\" storyline. A similar set of events happen in Crystal Dynamics' Marvel's Avengers video game, where Khan (played by Sandra Saad) gets to bring the Avengers back together after becoming aware of her powers in amidst a conspiracy.After Ms. Marvel, Kamala Khan is also set to team up with Carol Danvers and Monica Rambeau's 'Photon' in the sequel to 2019's Captain Marvel, now titled 'The Marvels' which is currently in production.",
        "imageUrl": "https://sm.ign.com/t/ign_in/screenshot/default/ms-marvel-promo-art-disney-plus-2_9qaq.1280.jpg",
        "author": "Rahul Majumdar"
    },
    {
        "id": 8,
        "title": "Halo Infinite Campaign Overview Coming on Monday, October 25 With New Synopsis Revealed",
        "body": "343 Industries has revealed a new synopsis for Master Chief's next adventure on Zeta Halo with more of Halo Infinite's campaign being revealed on Monday. The campaign overview will be streamed on Xbox and 343's official channels at 6:30 PM (IST) today.The new synopsis reads:The Banished have defeated UNSC forces and taken control of the mysterious Zeta Halo, threatening the survival of humankind. When all hope is lost and humanity’s fate hangs in the balance, the Master Chief returns to confront the most ruthless foe he’s ever faced.This will mark the first time since last year's Xbox Games Showcase that we'll get an in-depth look at Halo Infinite's campaign. Joseph Staten, Head of Creative on Halo Infinite, had previously addressed the lack of campaign news, most notably at Gamescom 2021 on a recent Inside Infinite blog post.\"We're at a critical phase in the flight that is Halo Infinite, so it's extremely important to avoid distractions and stay focused on mission-critical tasks only,\" Staten wrote. \"For Campaign, that means putting maximum effort into ensuring the wide-open, adventure-filled experience you'll all get to play on December 8 is as great as it can possibly be. And gameplay demos and trailers not only take a huge amount of effort to do well, they also take cycles away from bugs and other shutdown tasks.\"While the lack of campaign info has been disappointing, Halo Infinite has been shaping up to be one of the best in the franchise, at least in the multiplayer department. The game's multiple 'test flights' were received with acclaim from fans and newcomers, and 343 has shown that significant progress has been made on the scalability and visuals of the game over its poor showing last year.To celebrate the game's release, Xbox is also releasing a custom Halo themed Xbox Series X along with a new Xbox Elite Wireless controller, although just like the game's price on Steam, they are well above what they should cost in India. Regardless, Microsoft is gearing up to win big in the last quarter of 2021 with some significant games that should make up for the lack of exclusive games in the launch year of the Xbox Series X|S consoles.Halo Infinite releases on PC, Xbox One, Xbox Series X|S and Xbox Game Pass consoles on December 8, 2021.",
        "imageUrl": "https://sm.ign.com/t/ign_in/news/h/halo-infin/halo-infinite-campaign-gameplay-overview-announced-for-tomor_z3u9.1280.jpg",
        "author": "Rahul Majumdar"
    },
    {
        "id": 9,
        "title": "Grand Theft Auto: The Trilogy – The Definitive Edition India Price and Release Date Revealed, Will Be Included on Xbox Game Pass",
        "body": "Grand Theft Auto: The Trilogy - The Definitive Edition will release on November 11, 2021 across PC and consoles. Grand Theft Auto: San Andreas - The Definitive Edition will also release on Xbox Game Pass, although it's not clear if that includes just console or also PC. Grand Theft Auto 3 - The Definitive Edition will be available on PlayStation Now, although that service isn’t available in India yet.Rockstar announced the news along with an in-game teaser showcasing the new graphical changes to the classic trilogy. There are no additional deluxe or special editions of the game. Surprisingly the game won't be releasing on Steam, which is unfortunate (and a little illogical) considering Rockstar has delisted the classic versions of the game from the storefront. Those who purchase the trilogy on Rockstar Launcher by January 5, 2022 will receive $10 off a product priced at $15 or more (regional prices haven't been listed). The game will also get a physical disk release on December 7, 2021.",
        "imageUrl": "https://sm.ign.com/t/ign_in/news/g/grand-thef/grand-theft-auto-the-trilogy-the-definitive-edition-official_7b75.1280.jpg",
        "author": "Geneen Roth"
    }
]